Конфигурация/src/Catalogs/ЭтапыПроекта/ЭтапыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроекта</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ЭтапыПроектаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипЭтапа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧДействия</name>
    <attributes>
      <name>ИмяДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбработчикДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДействия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧТабличныеДанные</name>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСтруктураКолонок</name>
    <attributes>
      <name>ИмяКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Enums/ТипЭтапа/ТипЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЭтапа</name>
  <enumValues>
    <name>Видео</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Обсуждение</name>
  </enumValues>
  <enumValues>
    <name>Протокол</name>
  </enumValues>
  <enumValues>
    <name>Задачи</name>
  </enumValues>
  <enumValues>
    <name>Аудио</name>
  </enumValues>
  <enumValues>
    <name>РасшифровкаВидео</name>
  </enumValues>
  <enumValues>
    <name>ОбработаннаяРасшифровка</name>
  </enumValues>
  <enumValues>
    <name>СхемаДанных</name>
  </enumValues>
  <enumValues>
    <name>Класс</name>
  </enumValues>
  <enumValues>
    <name>Изображение</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Catalogs/ЭтапыПроекта/ManagerModule.bsl
#Область ОбщаяОбласть
#КонецОбласти

// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
//Возвращает ссылку на копию элемента справочника
//При этом копируются элементы подчиненных справочников
//Родителем копии будет являться элемент обозначающий месяц переданной даты
//АРГУМЕНТЫ:
//    Ссылка (СправочникСсылка) - Ссылка на копируемый элемент
//	  Наименование(Строка) - Наименование нового элемента справочника
//	  Дата (Дата) - Предполагаемая дата этапа	
Функция КопироватьШаблонСправочника(Ссылка, Наименование, Дата) Экспорт
	
	ЭтапГод = Строка(Формат(Дата,"ДФ=гггг"));
	ЭтапМесяц = Строка(Формат(Дата,"ДФ=ММММ"));
	
	ЭлементГод = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапГод, , , );
	Если ЭлементГод.Пустая() Тогда
		ЭлементГод = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементГод.Наименование = ЭтапГод;
		ЭлементГод.Записать();
	КонецЕсли;
	
	ЭлементМесяц = Справочники.ЭтапыПроекта.НайтиПоНаименованию(ЭтапМесяц, ,ЭлементГод , );
	Если ЭлементМесяц.Пустая() Тогда
		ЭлементМесяц = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ЭлементМесяц.Наименование = ЭтапМесяц;
		ЭлементМесяц.Родитель = ЭлементГод;
		ЭлементМесяц.Записать();
	КонецЕсли;
	
	ТзРодитель = Новый ТаблицаЗначений;
	ТзРодитель.Колонки.Добавить("Старый");
	ТзРодитель.Колонки.Добавить("Новый");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
		|ГДЕ
		|	ЭтапыПроекта.Ссылка В ИЕРАРХИИ (&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТзРодитель.Добавить();
		Элемент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаРодитель = ТзРодитель.Найти(Элемент.Родитель, "Старый"); 
		
		Если НЕ ВыборкаДетальныеЗаписи.Ссылка = Ссылка Тогда 
			
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Родитель = СтрокаРодитель.Новый.Ссылка;
			НовыйЭлемент.Записать();
		Иначе 
			НовыйЭлемент = Элемент.Скопировать();
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Родитель = ЭлементМесяц;
			НовыйЭлемент.Записать(); 
			
		КонецЕсли;
		
		НоваяСтрока.Старый = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Новый = НовыйЭлемент;
		
	КонецЦикла;
	
	ЭлементНовыйКоренной = ТзРодитель[0].Новый.Ссылка;
	
	Возврат ЭлементНовыйКоренной;
	
КонецФункции

Функция ПолучитьДействия(ЭтапПроекта) Экспорт
	
	ТаблицаДействия = Новый ТаблицаЗначений;
	ТаблицаДействия.Колонки.Добавить("ИмяДействия");
	ТаблицаДействия.Колонки.Добавить("ОбработчикДействия");
	ТаблицаДействия.Колонки.Добавить("ПредставлениеДействия");
	
	Если ЭтапПроекта = Перечисления.ТипЭтапа.Видео Тогда
		
		стр = ТаблицаДействия.Добавить();
		стр.ИмяДействия = "КнопкаДействияРасшифровкаВидео";
		стр.ОбработчикДействия = "РасшифроватьВидео";
		стр.ПредставлениеДействия = "Расшифровать видео";
		
	КонецЕсли;

	возврат ТаблицаДействия;
	
КонецФункции
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСВидео

Процедура РасшифроватьВидео(Объект) Экспорт 

	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",Объект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.РасшифровкаВидео);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РасшифровкаВидеоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		РасшифровкаВидеоОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		РасшифровкаВидеоОбъект.Родитель = Объект.Ссылка; 
		РасшифровкаВидеоОбъект.Наименование = "РасшифровкаВидео";
		РасшифровкаВидеоОбъект.Файл = Объект.Файл;
		РасшифровкаВидеоОбъект.ТипЭтапа = Перечисления.ТипЭтапа.РасшифровкаВидео;
		
	КонецЕсли;
	
	РасшифровкаВидеоОбъект.Текст = РасшифроватьВидеоСервер.ПолучитьРасшифровкуВидео();
	РасшифровкаВидеоОбъект.Записать();   
	
	Запрос = Новый запрос;
	Запрос.УстановитьПараметр("Родитель",РасшифровкаВидеоОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ТипЭтапа",Перечисления.ТипЭтапа.ОбработаннаяРасшифровка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭтапыПроекта КАК ЭтапыПроекта
	               |ГДЕ
	               |	ЭтапыПроекта.Родитель = &Родитель
	               |	И ЭтапыПроекта.ТипЭтапа = &ТипЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не Выборка.Следующий() Тогда
		
		ОбработаннаяРасшифровкаОбъект = Справочники.ЭтапыПроекта.СоздатьЭлемент();
		ОбработаннаяРасшифровкаОбъект.Родитель = РасшифровкаВидеоОбъект.Ссылка;  
		ОбработаннаяРасшифровкаОбъект.Файл = Объект.Файл;   
		ОбработаннаяРасшифровкаОбъект.Наименование = "ОбработаннаяРасшифровка";
		ОбработаннаяРасшифровкаОбъект.ТипЭтапа = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка;
		
		ОбработаннаяРасшифровкаОбъект.Записать();
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#Область Печать

#КонецОбласти
	
#КонецЕсли

// BSLLS:NestedFunctionInParameters-on
// BSLLS:EmptyRegion-on
